elisp/init-golang.org
#+title: init-golang

* Go-Mode Setting

#+BEGIN_SRC emacs-lisp
  ;(require 'go-mode-autoloads)
#+END_SRC 
  
* Company-Go Setting
#+BEGIN_SRC emacs-lisp
  (add-hook 'go-mode-hook (lambda ()
                            (set (make-local-variable 'company-backends) '(company-go))
                            (company-mode)))
  (add-hook 'before-save-hook 'gofmt-before-save)
#+END_SRC

* GO-Flymake Setting

#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path (concat (getenv "GOPATH") "/src/github.com/dougm/goflymake"))
  (require 'go-flymake)
#+END_SRC
  
* GO-Eldoc Setting

#+BEGIN_SRC emacs-lisp
  (require 'go-eldoc)
  (add-hook 'go-mode-hook 'go-eldoc-setup)
  (set-face-attribute 'eldoc-highlight-function-argument nil
                      :underline t :foreground "green"
                      :weight 'bold)
#+END_SRC
